Revit 2027 API
SKPImportOptions Class
 The import options used to import SKP format files.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.SKPImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SKPImportOptions : BaseImportOptions
Public Class SKPImportOptions
	Inherits BaseImportOptions
public ref class SKPImportOptions : public BaseImportOptions
type SKPImportOptions =
    class
        inherit BaseImportOptions
    end
The SKPImportOptions type exposes the following members.
Constructors
Name | Description
SKPImportOptions() |  Constructs a new instance of SKPImportOptions with default values of all properties.
SKPImportOptions(SKPImportOptions) |  Constructs a new instance of SKPImportOptions as a copy of the import options.
Top
Properties
Name | Description
AutoCorrectAlmostVHLines |  Correct almost-vertical lines and almost-horizontal lines for import model if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.
(Inherited from BaseImportOptions)
ColorMode |  Color mode for the import. Three modes are supported. Black and White, Preserve Colors, and Invert Colors.
(Inherited from BaseImportOptions)
CustomScale |  Scaling the import. If this is defined and a valid value (> 0.0), it takes priority over units.
(Inherited from BaseImportOptions)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from BaseImportOptions)
OrientToView |  Place the import at the same orientation as the view that was passed into the import method. This option can only be used when not importing into a single view.(i.e. ThisViewOnly is set to false)
(Inherited from BaseImportOptions)
Placement |  Where to place the import. Set this option to place the view at the origin or the center, or a shared coordinates.
(Inherited from BaseImportOptions)
ReferencePoint |  The 3D point in the document where the imported instance will be inserted. If not explicitly set, the instance will be inserted at the document origin.
(Inherited from BaseImportOptions)
ThisViewOnly |  Imports drawings into the view that was passed into the import method. This option is not available in 3D views.
(Inherited from BaseImportOptions)
Unit |  The unit of measure for imported geometry.
(Inherited from BaseImportOptions)
VisibleLayersOnly |  Only import the visible layers.
(Inherited from BaseImportOptions)
Top
Methods
Name | Description
Dispose
(Inherited from BaseImportOptions)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDefaultLengthUnit |  Get the default length unit used for importing unitless files.
(Inherited from BaseImportOptions)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLayerSelection |  Get all set layers name which user want to import into Revit.
(Inherited from BaseImportOptions)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetDefaultLengthUnit |  Set the default length unit used for importing unitless files.
(Inherited from BaseImportOptions)
SetLayerSelection |  Set the layers name which user want to import into Revit.
(Inherited from BaseImportOptions)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace